# cisco常用设备简介

## 交换机

### 配置途径

```sh
#主要有2种配置途径：
其一（console线），使用交换机自带的Console线缆连接到计算机的COM口，然后利用计算机的超级终端软件直接配置，首次配置通常使用这种方式
#交换机（console接口）——————PC机（RS232接口）
其二（RJ-45双绞线），通过telnet方式远程访问、配置交换机，这种方式要求此交换机已配置有IP地址且已接入计算机网络
#交换机（FastEthernet接口）——————PC机（FastEthernet接口）
```

### 配置命令

#### 主机密码设置

```bash
#命令输入错误卡住时同时按键盘ctrl+shift+6这三个键即可
```

```sh
switch>		 	  #用户模式
switch>enable	   #进入特权模式
switch#config terminal	   #进入全局配置模式
switch(config)#hostname switch01	#修改交换机命名
switch01(config)#enable password cisco01	#设置使能口令（明文传输）
switch01(config)#enable password cisco011	#设置加密口令（加密密文传输，优先于使能口令，也较安全）
```

#### 进入测试

```sh
switch01>enable		#进入特权模式
Password: 		    #这里需要加密口令，加密口令优先于使能口令
switch01#config terminal 	#进入全局配置模式
Enter configuration commands, one per line.  End with CNTL/Z.
switch01(config)#interface f2/1		#进入接口模式
switch01(config-if)#
```

#### 查看命令

```sh
switch01#show running-config		#查看交换机配置信息
switch01#show version			    #查看ios名称及版本信息
```

#### 清空命令

```sh
switch01#erase startup-config		#清空设备配置
switch01#reload					   #重启设备（此时配置及口令会被清除）
```

### 常用配置

#### 划分vlan1、vlan2、vlan3

```sh
#一般可能涉及两(多)台交换机vlan配置，两台交换机配置类似
#之后需要将两(多)台交换机之间相互连接，交换机之间对应的直连线接口加入对应的vlan中，两边即可通信
s1(vlan1 vlan2 vlan3)——————s2(vlan1 vlan2 vlan3)
```

```sh
s1#show vlan brief 			#查看vlan信息（默认只有vlan 1）
s1(config)#vlan 2			#创建vlan2
s1(config-vlan)#vlan 3		 #创建vlan3
s1(config)#interface range fastEthernet 0/3-4	#同时进入3-4接口
s1(config-if-range)#switchport  access vlan 2	#将3-4接口加入到vlan2
s1(config-if-range)#exit
s1(config)#interface range fastEthernet 0/5-6	
s1(config-if-range)#switchport access vlan 3
```

```sh
s1#show vlan brief 
VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
                                                Gig0/1, Gig0/2
2    VLAN0002                         active    Fa0/3, Fa0/4
3    VLAN0003                         active    Fa0/5, Fa0/6
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active
```

#### 二层交换机创建trunk中继链路

```sh
#简要说明：交换机端口有trunk和access两种模式，一般连接PC用access，设备之间互联选用trunk
	不创建trunk链路：有多组vlan在不同交换机设备上时，此时交换机设备之间的端口模式都是access
				   每组vlan需要一条直连线形成链路来实现通信，端口利用率低
	创建trunk链路：链路共享，可以传输多个vlan的数据，不仅仅只为某一个vlan服务
s1#show running-config 			#查看端口模式
s1(config)#interface fastEthernet 0/7-9	
s1(config-if)#switchport mode trunk		#设置s1设备额0/7端口为trunk，同时设置s2的0/7端口也为trunk
									 #此时两个设备连接的vlan就可以通过一条线通信，彼此不会相互影响
```

#### 三层交换机创建trunk中继链路

```sh
#简要说明：三层交换机设置trunk模式需要先进行封装
	国际通用的trunk协议为dot1q，所有厂家都要遵守这个共有标准，但是思科有自己的ISL私有封装协议
	思科与思科之间的设备可以使用dot1q，也可以使用私有的ISL封装协议，但是与其他厂商之间就只能使用dot1q协议来封装
##三层交换机操作：
###vlan1配置
Switch(config)#interface vlan 1
Switch(config-if)#ip address 192.168.1.254 255.255.255.0	#配置ip地址
Switch(config-if)#no shutdown							

###vlan2配置
Switch(config)#interface vlan 2
Switch(config-if)#ip address 192.168.2.254 255.255.255.0
Switch(config-if)#no shutdown
Switch(config)#ineterface  f0/2
Switch(config-if)#switchport access vlan 2 

###vlan3配置
Switch(config)#interface vlan 3
Switch(config-if)#ip address 192.168.3.254 255.255.255.0
Switch(config-if)#no shutdown
Switch(config)#ineterface  f0/3
Switch(config-if)#switchport access vlan 3

###给连接实际连接端口打trunk
Switch(config)#interface range f0/4-5
Switch(config-if-range)#switchport trunk encapsulation dot1q 
Switch(config-if-range)#switchport mode trunk 

##二层交换机
###s1配置vlan1、vlan2、vlan3、打trunk
Switch(config)#hostname s1
s1(config)#vlan 2
s1(config)#vlan 3
s1(config)#interface range fastEthernet 0/3-4
s1(config-if-range)#switchport access vlan 2
s1(config-if-range)#exit
s1(config)#interface range fastEthernet 0/5-6
s1(config-if-range)#switchport access vlan 3
s1(config-if-range)#exit
s1(config)#interface fastEthernet 0/7
s1(config-if)#switchport mode trunk 

###s2配置vlan1、vlan2、vlan3、打trunk
Switch(config)#hostname s2
s2(config)#vlan 2
s2(config)#vlan 3
s2(config)#interface range fastEthernet 0/3-4
s2(config-if-range)#switchport access vlan 2
s2(config-if-range)#exit
s2(config)#interface range fastEthernet 0/5-6
s2(config-if-range)#switchport access vlan 3
s2(config-if-range)#exit
s2(config)#interface fastEthernet 0/7
s2(config-if)#switchport mode trunk 

```

#### 二层交换机以太网配置（二层交换机）

```sh
s1(config-if-range)#channel-group 1 mode on		#配置以太通道（在s2上同样操作）
s1(config-if-range)#end

s1#show etherchannel summary 		#查看以太网
Flags:  D - down        P - in port-channel
        I - stand-alone s - suspended
        H - Hot-standby (LACP only)
        R - Layer3      S - Layer2
        U - in use      f - failed to allocate aggregator
        u - unsuitable for bundling
        w - waiting to be aggregated
        d - default port


Number of channel-groups in use: 1
Number of aggregators:           1

Group  Port-channel  Protocol    Ports
------+-------------+-----------+----------------------------------------------

1      Po1(SU)           -      Fa0/7(D) Fa0/8(P) Fa0/9(P) 
```



## 路由器

### 配置静态路由

```sh

```







